class Liketeam < ActiveHash::Base
  self.data = [
   { id: 0, name: '--' },{ id: 1, name: '読売ジャイアンツ' },{ id: 2, name: '阪神タイガース' },
   { id: 3, name: '広島東洋カープ' },{ id: 4, name: '東京ヤクルトスワローズ' },{ id: 5, name: '横浜DeNAベイスターズ' },
   { id: 6, name: '中日ドラゴンズ' },{ id: 7, name: '北海道日本ハムファイターズ' },{ id: 8, name: 'オリックス・バファローズ' },
   { id: 9, name: '千葉ロッテマリーンズ' },{ id: 10, name: '東北楽天ゴールデンイーグルス' },{ id: 11, name: '福岡ソフトバンクホークス' },
   { id: 12, name: '埼玉西武ライオンズ' },{ id: 13, name: '北海道コンサドーレ札幌' },{ id: 14, name: 'ベガルタ仙台' },
   { id: 15, name: '鹿島アントラーズ' },{ id: 16, name: '浦和レッズ' },{ id: 17, name: '柏レイソル' },
   { id: 18, name: 'FC東京' },{ id: 19, name: '川崎フロンターレ' },{ id: 20, name: '横浜F・マリノス' },
   { id: 21, name: '横浜FC' },{ id: 22, name: '湘南ベルマーレ' },{ id: 23, name: '清水エスパルス' },
   { id: 24, name: '名古屋グランパス' },{ id: 25, name: 'ガンバ大阪' },{ id: 26, name: 'セレッソ大阪' },
   { id: 27, name: 'ヴェッセル神戸' },{ id: 28, name: 'サンフレッチェ広島' },{ id: 29, name: 'サガン鳥栖' },
   { id: 30, name: '大分トリニータ' },{ id: 31, name: '秋田ノーザンハピネッツ' },{ id: 32, name: 'レバンガ北海道' },
   { id: 33, name: '宇都宮ブレックス' },{ id: 34, name: '千葉ジェッツ' },{ id: 35, name: 'アルバルク東京' },
   { id: 36, name: 'サンロッカーズ渋谷' },{ id: 37, name: '横浜ビー・コルセアーズ' },{ id: 38, name: '新潟アルビレックスBB' },
   { id: 39, name: '富山グラウジーズ' },{ id: 40, name: '三遠ネオフェニックス' },{ id: 41, name: '川崎ブレイブサンダース' },
   { id: 42, name: 'シーホース三河' },{ id: 43, name: '滋賀レイクスターズ' },{ id: 44, name: '京都ハンナリーズ' },
   { id: 45, name: '大阪エヴェッサ' },{ id: 46, name: '琉球ゴールデンキングス' },{ id: 47, name: '島根スサノオマジック' },
   { id: 48, name: '名古屋ダイヤモンドドルフィンズ' }, { id: 49, name: 'NECグリーンロケッツ' }, { id: 50, name: 'NTTコミュニケーションズシャイニングアークス' },
   { id: 51, name: 'NTTドコモレッドハリケーンズ' }, { id: 52, name: 'キャノンイーグルス' }, { id: 53, name: 'クボタスピアーズ' },
   { id: 54, name: '神戸製鋼コベルコスティーラーズ' }, { id: 55, name: 'サントリーサンゴリアス' }, { id: 56, name: '東芝ブレイブルーパス' },
   { id: 57, name: 'トヨタ自動車ヴェルブリッツ' }, { id: 58, name: 'パナソニック ワイルドナイツ' }, { id: 59, name: '日野レッドドルフィンズ' },
   { id: 60, name: 'Honda HEAT' }, { id: 61, name: '三菱重工相模原ダイナボアーズ' }, { id: 62, name: '宗像サニックスブルース' },
   { id: 63, name: 'ヤマハ発動機ジュビロ' }, { id: 64, name: 'リコーブラックラムズ' }, { id: 65, name: 'その他' }
 ]
end
